backend/tests/load-test.yml
config:
  target: "http://localhost:3001"

phases:
  - duration: 250
    arrivalRate: 2
    rampTo: 2
    name: "500 Requests Over Time"

payload:
  path: "./users.csv"
  fields:
    - "email"

scenarios:
  - name: "User Login"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "password123"